"""
作业提交命名格式：日期_学号姓名_基本数据类型.py
举例：20220407_23张三_基本数据类型.py
"""

"""
作业1：
用print打印出下面内容：
⽂能提笔安天下，
武能上马定乾坤。
⼼存谋略何⼈胜，
古今英雄唯是君。
"""


"""
作业2：
变量名的命名规范？

"""



"""
作业3：
如下那个变量名是正确的？()
a.  name = '明明'
b.  _ = tom
c.  _9 = "老司机"
d.  9name = "宝宝"
e.  oldboy(edu = 666
"""



"""
作业4：
9、9.99、"hello world"、["hello","world"]、
{"姓名":"张三","age":19} 分别是什么数据类型？

"""



"""
作业5：
1）请使用列表切片的方式将list1列表的数据复制到列表list2中。
2）再从后向前取4个元素放到另一个新的列表list3中。
list1 = ["李白", "韩信", "程咬金", "百里玄策", "花木兰", "貂蝉"]
"""




"""
作业6：
现在有一个不完整的url，请使用三种方式得出完整的url。
url = "https://www.baidu.com/s?wd="
word = "手机"
想要的结果：url = "https://www.baidu.com/s?wd=手机"
"""
